 <!--搜索组件-->
<template>
  <el-dialog
    :close-on-click-modal="false"
    :close-on-press-escape="false"
    :modal="false"
    :modal-append-to-body="false"
    :visible="isVisible"
    width="400px"
  >
    <div class="container">
      <div @click="closeDialog" class="userSetting-header-topHeader-close">x</div>
      <div class="titleWrap">《NN用户注册及使用APP隐私协议》</div>
      <div class="contentWrap">
        感谢您对我们的信任，我们将按法律法规要求，采取严格的安全保护措施，保护您的个人隐私信息。雷神（武汉）信息技术有限公司（以下简称“雷神”）特此定制本《NN用户个人信息及隐私保护政策》（以下简称《用户隐私政策》）。在此，我们郑重的提醒您：
        在使用我们各项产品或服务前，请您务必仔细阅读并透彻理解用户隐私政策，详细了解我们收集、存储、使用、共享、转让、公开披露和保护您的个人信息的举措，如果您不同意本隐私政策的任何内容，您应当立即停止使用我们平台服务。当您使用我们提供的任一服务时，即表示您已同意我们按照本隐私政策来合法收集、使用和保护您的个人信息。如对本政策内容有任何疑问、意见或建议，您可以通过客服邮箱：service@nn.com与我们取得联系。
        本政策将帮助您了解如下内容：
        <br />一、关于我们
        <br />二、本《用户隐私政策》适用范围、相关词语涵义
        <br />三、我们如何收集和使用您的个人信息
        <br />四、我们如何使用Cookie和同类技术
        <br />五、我们如何共享、转让、公开披露您的个人信息
        <br />六、我们如何存储和保护您的个人信息
        <br />七、您对个人信息享有的控制权
        <br />八、未成年人保护
        <br />九、本隐私政策的更新
        <br />十、联系我们
        <br />一、关于我们
        <br />NN由雷神（武汉）信息技术有限公司（以下简称“雷神”）及其关联公司雷神科技有限公司提供产品运营和服务。
        关联公司是指在现在、将来控制雷神（武汉）信息技术有限公司、受雷神（武汉）信息技术有限公司控制或雷神（武汉）信息技术有限公司处于共同控制下的公司、机构。控制指通过所有权、有投票权的股份、合同、实际运营关联或其他被依法认定的方式直接或间接地拥有影响被控制对象管理/经营的能力。
        我们的主要运营主体的基本信息如下：雷神（武汉）信息技术有限公司，成立于2019年07月08日，联系电话为：027-86951781；注册地址为：武汉市洪山区雄楚大街229号春林庭苑综合楼A座2单元1602室(03)；常用办公地址为：武汉市东湖新技术开发区花城大道9号软件新城2期C11栋14楼。
        <br />二、本《用户隐私政策》适用范围、相关词语涵义
        <br />（一）本《用户隐私政策》适用范围
        本《用户隐私政策》为我们的所有产品与/或服务统一适用的通用内容，当您使用我们的任何产品与/或服务时，本《用户隐私政策》即适用，无论该产品与/或服务是否单独设置了隐私条款，也无论您是浏览用户（访客）还是注册登录用户。但请您注意，本《用户隐私政策》不适用于以下情况：
        <br />1. 为我们的产品与/或服务提供广告服务的第三方的信息收集/处理做法；
        <br />2. 我们的产品与/或服务可能会包含或链接至第三方提供的信息与/或第三方服务（包括任何第三方应用、网站、产品、服务等），这些信息与/或服务由第三方负责运营，您使用该等信息与/或服务与我们无关。我们在此善意的提醒您，您在使用第三方信息与/或服务时，应留意和仔细阅读第三方向您展示的相关用户协议和隐私政策，并妥善保管和谨慎提供您的个人信息。本《用户隐私政策》仅适用于我们所收集的您的个人信息，并不适用于任何第三方对您的个人信息的收集，以及任何第三方提供的服务或第三方的信息使用规则，我们对任何第三方收集、储存和使用的您个人信息的行为在法律允许的范围内亦不承担任何责任；
        <br />3. 其他非NN向您提供的产品与/或服务内容。
        <br />（二）相关词语涵义
        <br />1. 个人信息（出自于GB/T 35273-2017《信息安全技术个人信息安全规范》）：指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。本隐私政策中涉及的个人信息包括个人基本资料（包括个人姓名、生日、性别、住址、个人电话号码、电子邮箱）、个人身份信息（包括身份证信息）、个人生物识别信息（包括指纹、面部特征）、网络身份标识信息（包括系统账号、IP地址、邮箱地址以及与前述有关的密码、口令、口令保护答案、用户个人数字证书）、个人财产信息（包括银行账号、鉴别信息（口令）、资金信息（包括资金数量、收益、余额、支付收款记录等）、交易和消费记录、流水记录、虚拟货币、虚拟交易、兑换码等虚拟财产信息、通讯录信息、个人上网记录（包括网站浏览记录、软件使用记录、点击记录）、个人常用设备信息（包括硬件序列号、硬件型号、设备MAC地址、操作系统类型、软件列表、唯一设备识别码（如IMEI/androidID/IDFA/OPENUDID/GUID、SIM卡IMSI信息等在内的描述个人常用设备基本情况的信息）、个人位置信息（包括大概地理位置、精准定位信息）。我们实际具体收集的个人信息种类以下文描述为准。
        <br />2. 个人敏感信息（出自于GB/T 35273-2017《信息安全技术个人信息安全规范》）：指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。本隐私政策中涉及的个人敏感信息包括您的财产信息（包括银行账号、鉴别信息（口令）、资金信息（包括资金数量、收益、余额、支付收款记录等）、交易和消费记录、流水记录、虚拟货币、虚拟交易、兑换码等虚拟财产信息、个人生物识别信息（包括指纹、面部特征）、个人身份信息（包括身份证信息）、网络身份识别信息（包括系统账号、邮箱地址以及与前述有关的密码、口令、口令保护答案、用户个人数字证书）、其他信息（包括通讯录信息、个人电话号码、精准定位信息、收货地址、网页浏览记录）。您同意您的个人敏感信息按本《用户隐私政策》所述的目的和方式来处理。我们实际具体收集的个人敏感信息种类以下文描述为准。相比其他个人信息，个人敏感信息可能对您的个人权益影响更大。我们在此善意的提醒您需在谨慎考虑后再向我们提供您的个人敏感信息，我们实际具体收集的个人信息种类以下文描述为准。
        <br />3. 设备：是指可用于访问我们的产品和/或服务的装置，例如台式计算机、笔记本电脑、平板电脑或智能手机。
        <br />4. 唯一设备标识符（专属 ID 或 UUID）：是指由设备制造商编入到设备中的一串字符，可用于以独有方式标识相应设备（例如手机的 IMEI 号）。唯一设备标识符有多种用途，其中可在不能使用 Cookie（例如在移动应用程序中）时用以提供广告。
        <br />5. IP 地址：每台上网的设备都会指定一个编号，称为互联网协议 ( IP ) 地址。这些编号通常都是根据地理区域指定的。IP 地址通常可用于识别设备连接至互联网时所在的位置。
        <br />6. SSL：SSL（Secure Socket Layer）又称为安全套接层，是在传输通信协议（TCP/IP）上实现的一种安全协议。SSL 支持各种类型的网络，同时提供三种基本的安全服务，均通过使用公开密钥和对称密钥技术以达到信息保密的效果。
        <br />7. Cookie：Cookie是包含字符串的小文件，在您登入和使用网站或其他网络内容时发送、存放在您的计算机、移动设备或其他装置内（通常经过加密）。Cookie同类技术是可用于与Cookie类似用途的其他技术，例如：Web Beacon、Proxy、嵌入式脚本等。
        <br />8. 账号：当您注册账号并向我们提供一些个人信息，您就可以更好的使用我们的服务。当您访问哔哩哔哩时，系统会利用这些账号信息对您进行身份验证，以防止未经授权的人员访问您的账号。
        <br />9. 去标识化/匿名化：是指通过对个人信息的技术处理，使其在不借助额外信息的情况下，无法识别个人信息主体，且处理后的信息不能被复原的过程。
        <br />10. 服务器日志：通常情况下，我们的服务器会自动记录您在访问网站时所发出的网页请求。这些“服务器日志”通常包括您的网络请求、互联网协议地址、浏览器类型、浏览器语言、请求的日期和时间及可以唯一识别您的浏览器的一个或多个 Cookie。
        <br />三、我们如何收集和使用您的个人信息
        <br />1. NN依据法律法规以及遵循正当、合法、必要的原则而收集和使用您在使用服务过程中主动提供或由于产品和/或服务需要而产生的个人信息。如果我们欲将您的个人信息用于本隐私政策未载明的其它用途，或基于特定目的将收集而来的信息用于其他目的，我们会及时以合理的方式向您告知，并在使用前再次征得您的同意。
        <br />2. 我们收集和使用的您的个人信息类型包括两种：第一种：我们产品与/或服务的核心业务功能所必需的信息：此类信息为产品与/或服务正常运行的必备信息，您须授权我们收集。如您拒绝提供，您将无法正常使用我们的产品与/或服务；第二种：附加业务功能可能需要收集的信息：此信息为非核心业务功能所需的信息，您可以选择是否授权我们收集。如您拒绝提供，将导致附加业务功能无法实现或无法达到我们拟达到的效果，但不影响您对核心业务功能的正常使用。
        <br />3. 我们需要特别提醒您的是：由于我们的产品和服务较多，为您提供的内容也不同，因此核心业务功能（包括其收集的您的个人信息类型）也会因产品/服务的内容不同而有所区别，具体以产品/服务实际提供为准。除此之外，您理解并同意，我们希望提供给您的产品和服务是完善的，所以我们会不断改进我们的产品和服务，包括技术，这意味着我们可能会经常推出新的业务功能，可能需要收集新的个人信息或变更个人信息使用目的或方式。如果某一需要收集您的个人信息的功能或产品/服务未能在本隐私政策中予以说明的，我们会通过更新本政策、页面提示、弹窗、网站公告等方式另行向您说明该信息收集的目的、内容、使用方式和范围，并为您提供自主选择同意的方式，且在征得您明示同意后收集。在此过程中，如果您对相关事宜有任何疑惑的，可以通过本隐私政策第十条提供的方式联系我们，我们会尽快为您作出解答。
        雷神仅会依据本政策所述的以下目的，收集和使用您的个人信息：
        <br />(一)注册为用户
        <br />1. 用户在注册账号或使用本服务过程中，需要填写一些或提交一些必要的信息：您的手机号码（个人敏感信息，用于接受验证码匹配个人身份）、性别、生日、创建的账号昵称、密码。
        <br />2. 我们的产品支持您使用第三方平台的账号（微信账号/QQ账号）进行登录，如您使用第三方平台的账号登录的，我们将根据您的授权获取该第三方账号下的相关信息（包括：用户名、昵称、头像、性别）以及身份验证信息（个人敏感信息）。我们承诺，收集上述信息是用于为您提供账号登录服务以及保障您的账号安全，防范安全风险。如您拒绝授权此类信息，则您将无法使用第三方平台的账号登录我们平台，但不影响我们提供的其他产品和服务的正常使用。
        <br />3. 同时，您需理解，手机号码和验证码匹配结果属于您的个人敏感信息，我们收集该类信息是基于法律法规的相关要求，如您拒绝提供可能导致您无法注册账号并使用相关产品功能，请您谨慎考虑后再选择是否提供。
        在注册过程中，如果您提供以下额外的信息，将有助于我们为您提供更好的服务和体验：如学校、职业、兴趣爱好。但如果您不提供这些信息，将不会影响本服务的基本业务功能。
        <br />(二)注册成为大神
        用户在注册大神时需提供头像、相关必要的个人用户账号数据材料以及实名认证，即姓名、身份证号、身份证的正面清晰照、本人手持身份证照片。
        若未实名认证则无法申请成为大神，同时雷神处于对未成年人的保护，不允许未成年人申请成为大神进行平台交易。
        <br />(三)进行下单与提现
        用户在申请提现时需补交身份证反面的照片来用以核实提现人的身份信息。此外您需要提供您的银行卡号、开户地、开户支行来确保您提现的金额能够正常转入您的账户。
        上述信息若提交不能或未按要求提交则无法完成提现功能。
        <br />(四)保障产品、服务及用户使用安全
        为帮助我们更好地了解“NN”及相关服务的运行情况，以便确保运行与提供服务的安全，我们可能记录网络日志信息，以及使用“NN”及相关服务的频率、崩溃数据、总体安装、使用情况、性能数据等信息。
        <br />(五)搜索
        当您在我们的产品中使用搜索功能时，我们需要收集您的一些信息，其中包括如下个人信息：您的设备信息、您的日志信息，包括您搜索的字或词、您的浏览记录和时间、您搜索的时间以及次数。我们收集这些信息是为了向您快速匹配您所需要的内容以及您可能感兴趣的内容，同时亦为了改进我们的产品和服务。
        <br />(六)视频展示和播放
        我们的产品和/或服务为您提供视频展示和播放服务，在此过程中，我们需要收集您的一些信息，包括如下个人信息：设备型号、设备名称、设备唯一标识符、浏览器类型和设置、语言设置、操作系统和应用程序版本、登录IP地址、接入网络的方式、网络质量数据、移动网络信息、产品版本号、网络日志信息（如操作日志、服务日志）。同时为了收集上述基本的个人设备信息，我们将会申请访问您的设备信息的权限，我们收集这些信息是为了向您提供视频展示和播放服务，如您拒绝提供上述权限将可能导致您无法使用我们的相关产品与服务。请您理解，单独的设备信息、日志信息等是无法识别特定自然人身份的信息。如果我们将这类非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，除取得您授权或法律法规另有规定外，我们会将该类个人信息做匿名化、去标识化处理。
        <br />(七)下单和支付
        当您在我们的产品与/或服务中购买商品或服务的，您需要提供一些下单与完成交易所需要的信息，包括：交易商品或服务信息等，此外，我们也可能会再收集一些其他与订单相关的信息，包括：订单号、交易金额、下单时间、订单商户、订单编号、订单状态、支付方式、支付账号、支付状态（个人敏感信息），我们收集这些信息是为了帮助您顺利完成交易、保障您的交易安全、查询订单信息、提供客户服务等。
        在支付过程中，我们可能会收集您的第三方支付渠道的user ID (例如支付宝user ID、微信open ID、QQ钱包open ID或银行卡信息)（个人敏感信息）。上述信息为我们向您提供您购买商品和/或服务所必须的信息，我们无法仅根据该信息获得您的个人财产信息，也不能识别特定自然人身份信息。
        <br />(八)账户安全保障功能
        我们需要收集您的一些信息来保障您使用我们的产品与/或服务时的账号与系统安全，并协助提升我们的产品与/服务的安全性和可靠性，以防产生任何危害您、NN、社会的行为，包括：账号登录地、个人常用设备信息、登录IP地址、产品版本号、语言模式、浏览记录、网络使用习惯、服务故障信息、交易信息、会员实名认证信息。我们会根据上述信息来综合判断您账号、账户及交易风险、进行身份验证、客户服务、检测及防范安全事件、诈骗监测、存档和备份用途，并依法采取必要的记录、审计、分析、处置措施，一旦我们检测出存在或疑似存在账号安全风险时，我们会使用相关信息进行安全验证与风险排除，确保我们向您提供的产品和服务的安全性，以用来保障您的权益不受侵害。同时，当发生账号或系统安全问题时，我们会收集这些信息来优化我们的产品和服务。
        <br />(九)客户服务
        当您向NN发起投诉、申诉或进行咨询时，为了您的账号与系统安全，我们可能需要您先行提供账号信息，并与您之前的个人信息相匹配以验证您的用户身份。同时，为了方便与您联系或帮助您解决问题，我们可能还需要您提供姓名、手机号码及其身份信息（手机号归属证明、证件信息）（个人敏感信息）。另外，我们还会收集您与我们的沟通信息（包括文字/图片/音视频/通话记录形式）、与您的需求相关联的其他必要信息。我们收集这些信息是为了调查事实与帮助您解决问题，如您拒绝提供上述信息，我们可能无法向您及时反馈投诉、申诉或咨询结果。
        <br />(十)图文、视频分享
        当您在使用评论、弹幕、分享、发帖（包括投稿、动态和相簿）功能时，我们会收集您主动提供的上述图文、视频内容信息，同时我们还将为便于您分享视频和图片而经过您的同意后访问您的手机相册权限。同时，您也可以随时通过您设备的相关功能设置开启/取消该权限。例如您可以通过iOS设备中的“设置-隐私-照片”来关闭您对手机相册的授权。您开启该权限即视为您授权我们可以访问、获取、收集、使用您的该等个人信息；当您取消该授权后，我们将不再收集该信息，也无法再为您提供上述与之对应的服务；但除非您依照法律的规定删除了您的个人信息，否则您的取消行为不会影响我们基于您之前的授权进行的对您个人信息的处理、存储。
        <br />(十一) 拍摄照片（含拍摄视频服务、直播服务）
        当您使用设备相机扫描二维码、拍摄照片、拍摄视频（包括直播）时，我们将访问您的设备相机相关权限，并收集您提供的基于扫描二维码、拍摄照片、拍摄视频后向我们上传的图片、视频信息。如您拒绝提供该权限和内容的，仅会使您无法使用该功能，但并不影响您正常使用产品与/或服务的其他功能。同时，您也可以随时通过您设备的相关功能设置开启/取消该权限。您开启该权限即视为您授权我们可以访问、获取、收集、使用您的该等个人信息；当您取消该授权后，我们将不再收集该信息，也无法再为您提供上述与之对应的服务；但除非您依照法律的规定删除了您的个人信息，否则您的取消行为不会影响我们基于您之前的授权进行的您个人信息的处理、存储。
        <br />(十二) 录制视频、直播
        当您使用录制视频以及直播服务时我们将访问您的设备录音（麦克风）相关权限，我们需要收集您的语音信息、语音交互信息（个人信息）。如您拒绝提供的仅会使您无法使用该功能，但并不影响您正常使用产品与/或服务的其他功能。同时，您也可以随时通过您设备的相关功能设置开启/取消该权限。
        <br />(十三) 定向推荐、维护/改进我们的产品与/或服务之必需
        我们会基于收集的信息，对您的偏好、习惯、位置作特征分析和用户画像，以便为您提供更适合的定制化服务，例如向您展现或推荐相关程度更高（而非普遍推送）的搜索结果、视频内容、品类内容、信息流或者广告/推广信息结果。为此，我们需要收集的信息包括您的设备信息、浏览器型号、日志信息、浏览记录、点赞/分享/评论/互动的对象、搜索的字词、位置（个人敏感信息）。例如：推荐您可能喜欢的大神、动态内容、等。
        更进一步的，我们可能会收集您使用我们的产品与/或服务时的搜索记录、浏览记录、观看时长、订单信息、设备信息、点赞/分享/评论/互动的对象、您的偏向网络行为、兴趣偏好等信息形成用户画像用于帮助使我们更加了解您如何接入和使用我们的产品与/或服务、维护和改进我们的产品与/或服务或对您作出其他方面的回应。
        <br />(十四) 动态
        当您开启了您的设备定位功能并同时在发布动态时选择使用我们基于地理位置提供的定位功能时，我们可能会收集有关您的精准位置信息（个人敏感信息）。如您拒绝提供的仅会使您无法使用该功能，但并不影响您正常使用产品与/或服务的其他功能。同时，您也可以随时通过您设备的相关功能设置开启/取消该权限。例如您可以通过iOS设备中的“设置-隐私-定位服务”来关闭您对定位的授权。您开启该权限即视为您授权我们可以访问、获取、收集、使用您的该等个人信息；但当您取消该授权后，我们将不再收集该信息，也无法再为您提供上述与之对应的服务；但除非您依照法律的规定删除了您的个人信息，否则您的取消行为不会影响我们基于您之前的授权进行的您个人信息的处理、存储。
        <br />(十五) 从第三方间接收集的您的个人信息
        <br />1. 您理解并知悉，您向外部第三方（NN旗下关联公司不在此限）提供的个人信息，或外部第三方收集的您的个人信息，我们无法获取，更不会使用非常规方式（如：恶意干预对方系列应用程序数据）擅自以软件程序获得您的个人信息。NN可能因业务发展的需要而确实需要从第三方间接收集（如共享等）您的个人信息的，且由我们直接或共同为您提供产品或服务的，我们（或第三方）在收集前会向您明示共享的您个人信息的来源、类型、使用目的、方式和所用于的业务功能、授权同意范围（如果使用方式和范围超出您在第三方原授权范围的，我们会再次征得您的授权同意）。我们的某些产品或服务由第三方业务合作伙伴提供或共同提供时，为了必要且合理的开展业务，我们可能会从部分业务合作伙伴处间接收集的您的部分信息、其他方使用我们的产品与/或服务时所提供有关您的信息。
        <br />2. 我们的专业安全团队对个人信息将进行安全加固（包括敏感信息报备、敏感信息加密存储、访问权限控制等）。我们会使用不低于我们对自身用户个人信息同等的保护手段与措施对间接获取的个人信息进行保护。
        <br />(十六) 出于其他合理且必要的目的
        <br />1. 如前文所述，如果某一需要收集您的个人信息的功能或产品/服务未能在本隐私政策中予以说明的，或者我们超出了与收集您的个人信息时所声称的目的及具有直接或合理关联范围的，我们将在收集和使用你的个人信息前，通过更新本隐私政策、页面提示、弹窗、站内信、网站公告或其他便于您获知的方式另行向您说明，并为您提供自主选择同意的方式，且在征得您明示同意后收集和使用。
        <br />2. 您理解并同意，在以下情况下，我们无需取得您的授权同意即可收集和使用您的个人信息：
        <br />a)与国家安全、国防安全有关的；
        <br />b)与公共安全、公共卫生、重大公共利益有关的；
        <br />c)与犯罪侦查、起诉、审判和判决执行等直接相关的；
        <br />d)出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
        <br />e)所收集的信息是您自行向社会公开的或者是从合法公开的渠道（如合法的新闻报道、政府信息公开等渠道）中收集到的；
        <br />f)根据与您签订和履行相关协议或其他书面文件所必需的；
        <br />g)用于维护我们的产品与/或服务的安全稳定运行所必需的，例如发现、处置产品与/或服务的故障；
        <br />h）有权机关的要求、法律法规等规定的其他情形。
        <br />四、我们如何使用Cookie和同类技术
        为使您获得更轻松的访问体验，您使用NN产品或服务时，我们可能会通过采用各种技术收集和存储您访问NN服务的相关数据，在您访问或再次访问NN服务时,我们能识别您的身份，并通过分析数据为您提供更好更多的服务。包括使用小型数据文件识别您的身份，这么做是为了解您的使用习惯，帮您省去重复输入账户信息的步骤，或者帮助判断您的账户安全。这些数据文件可能是Cookie、Flash Cookie，或您的浏览器或关联应用程序提供的其他本地存储（统称“Cookie”）。
        请您理解，我们的某些服务只能通过使用Cookie才可得到实现。如果您的浏览器或浏览器附加服务允许，您可以修改对Cookie的接受程度或者拒绝NN的Cookie，但拒绝NN的Cookie在某些情况下您可能无法使用依赖于cookies的NN服务的部分功能。
        网页上常会包含一些电子图像，称为“单像素 GIF 文件”或“网络 beacon”，它可以帮助网站计算浏览网页的用户或访问某些cookie。我们会通过网络beacon收集您浏览网页活动信息，例如您访问的页面地址、您先前访问的援引页面的位址、您停留在页面的时间、您的浏览环境以及显示设定等。
        <br />五、我们如何共享、转让、公开披露您的个人信息
        <br />（一）共享
        我们不会与雷神（武汉）科技有限公司以外的任何公司、组织和个人分享您的个人信息，但以下情况除外：
        <br />1. 在获取明确同意的情况下共享：获得您的明确同意后，我们将与其分享您的个人隐私信息；
        <br />2. 根据法律法规或有权机关的指示提供用户的个人隐私信息；
        <br />3. 在法律要求或允许的范围内，为了保护NN及其用户或社会公众的利益、财产或安全免遭损害而有必要提供您的个人信息给第三方；
        <br />4. 您的个人信息可能会在我们的关联公司之间共享。我们只会共享必要的个人信息，且这种共享亦受本隐私政策声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意；
        <br />5. 为了向您提供更完善、优质的产品和服务，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。同时，我们会与合作伙伴签署严格的保密协定，要求他们按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理您的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。如果您拒绝我们的合作伙伴在提供服务时收集为提供服务所必须的个人信息，将可能导致您无法在我们的平台中使用该第三方服务。通常我们的合作伙伴有如下几类：
        <br />a) 为我们的产品与/或服务提供功能支持的服务提供商：例如提供支付服务的支付机构，我们共享信息的目的仅为实现我们产品与/或服务的功能;
        <br />b) 第三方SDK类服务商：我们的产品中可能会包含第三方SDK或其他类似的应用程序，如您在我们平台上使用这类由第三方提供的服务时，您同意将由其直接收集和处理您的信息（如以嵌入代码、插件等形式）。例如：您使用华为手机的，华为Push SDK需要读取您的IMEI信息，用于推送/下发通知栏消息（如您使用其他品牌的，各手机品牌也有类似的Push SDK）；您使用支付宝付款的，为了让您完成交易、实现交易目的，支付宝SDK需要读取您的IMEI信息；您把在NN的内容分享到第三方平台，如微博、微信、QQ，其SDK可能会收集您提供的信息；我们可能会使用极光push SDK和一键登录SDK来发送推送以及提供快捷登录我们可能会使用umeng SDK 和阿里云SDK来统计用户使用产品或服务的活跃度，umeng SDK和阿里云SDK可能需要读取您的设备信息；我们会使用数美SDK来保障您的账号安全以及评估您在NN内的风险等级，数美SDK可能需要获取您的设备IP地址、设备硬件序列号、设备MAC地址、设备安全、设备安装应用列表和IMEI信息统计。前述服务商收集和处理信息等行为遵守其自身的隐私条款，而不适用于本政策。为了最大程度保障您的信息安全，我们建议您在使用任何第三方SDK类服务前先行查看其隐私条款。为保障您的合法权益，如您发现这等SDK或其他类似的应用程序存在风险时，建议您立即终止相关操作并及时与我们取得联系。
        <br />(二)转让
        我们不会将您的个人隐私信息转让给任何公司.组织和个人，但以下情况除外：
        在获取明确同意的情况下共享：获得您的明确同意后，我们将与其分享您的个人隐私信息；
        在涉及合并、收购、破产清算时，如涉及个人隐私信息转让，我们将要求受让方继续受此政策约束，否则我们将要求受让方向您重新索取授权同意。
        <br />（三）公开披露
        <br />1. 公开披露是指向社会或不特定人群发布信息的行为。我们仅在下列情形下，公开披露您的个人隐私信息：
        <br />a) 征得您明确的授权同意；
        <br />b) 基于国家法律法规的规定而对外披露；
        <br />c) 应国家司法机关及其他有关机关基于法定程序的要求而披露；
        <br />d) 为保护您的合法权益不受损而披露；
        <br />e) 在紧急情况下，为保护其他用户及第三方人身安全而披露；
        <br />f) 应用户监护人合法要求而提供用户个人身份信息时；
        <br />g) 任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致用户个人隐私信息泄露的。
        <br />h) 对违规账号、欺诈行为等进行处罚公告、公布中奖/获胜者等名单时脱敏展示相关信息等必要事宜而进行的必要披露
        <br />2. 对于公开披露的您的个人信息，我们会在收到公开披露申请后第一时间且审慎审查其正当性、合理性、合法性，并在公开披露时和公开披露后采取最严格个人信息安全保护措施和手段对其进行保护。
        <br />3. 共享、转让、公开披露您的个人信息的例外
        请您知悉，根据法律法规的规定，在下述情况下，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：
        <br />a) 与国家安全、国防安全直接相关的；
        <br />b) 与公共安全、公共卫生、重大公共利益直接相关的；
        <br />c) 与犯罪侦查、起诉、审判和判决执行等直接相关的；或根据法律法规的要求、行政机关或公检法等有权机关的要求的；
        <br />d) 出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的;
        <br />e) 个人信息是您自行向社会公开的或者是从合法公开的渠道（如合法的新闻报道、政府信息公开等渠道）中收集到的；
        <br />f) 根据与您签订和履行相关协议或其他书面文件所必需的；
        <br />g) 法律法规等规定的其他情形。
        <br />六、我们如何存储和保护您的个人信息
        <br />（一）个人信息的存储方式
        我们会按照法律法规规定，将境内收集的用户个人信息存储于中国境内。目前我们不会跨境传输或存储您的个人信息或向境外提供个人信息的场景。将来如需跨境传输或存储的，我们会单独向您明确告知信息出境的目的、接收方、使用方式和范围、安全保证措施和安全风险，并再次征得您及监管部门的同意，并严格要求接收方按照本《用户隐私政策》以及其他相关要求来处理您的个人信息。
        我们会通过安全的方式存储您的信息，包括本地存储（例如利用应用软件进行数据缓存）、数据库和服务器日志。
        一般情况下，我们只会在为实现服务目的所必需的时间内或法律法规规定的条件下存储您的个人信息。您可以自主选择删除观看历史、订阅等在使用“NN”服务时提供的和产生的个人信息，如果您选择删除上述信息，我们也将删除相应的个人信息。
        当我们的产品或服务发生停止运营的情况时，我们将以推送通知、公告等形式通知您，并在合理期限内删除您的个人信息或进行匿名化处理，法律法规另有规定的除外。
        <br />（二）个人信息的保护措施
        数据传输方面，采用传输层安全协议等密码技术，通过Https等方式防止传输链路被嗅探、窃听截取风险，建立安全的隐私数据采集环境，保证数据采集的私密性和完整性。
        数据存储方面，我们会通过安全的方式存储您的信息，包括本地存储（例如利用应用程序进行数据缓存）。我们只会在为实现服务目的所必需的时间内或法律法规规定的条件下存储您的个人信息。您可以自主选择删除观看历史、视频缓存、搜索记录等您在使用NN服务时提供和产生的数据记录。
        信息安全方面，我们努力为您的信息安全提供保障，以防止信息的泄露、丢失、不当使用、未经授权访问和披露等。我们使用多方位的安全保护措施，以确保您的个人信息保护处于合理的安全水平，包括技术保护手段、管理制度控制、安全体系保障等诸多方面。
        数据访问和使用的安全控制方面，实施严格的数据权限控制机制，采取多重身份认证技术，并对能够处理您的信息的行为进行监控，避免数据被违规访问和未授权使用。
        建立完整的审计机制，对数据生命周期的全流程进行监控与审计，防止您的个人信息遭遇未经授权的访问、公开披露、使用、修改、人为或意外的损坏或丢失。
        其他可行的安全组织和管理措施：
        <br />- 在我们从第三方间接收集您的个人信息前，我们会明确以书面形式（如合作协议、承诺书）要求该第三方在已经取得您明示同意后收集以及处理（如共享等）个人信息，在书面协议层面要求第三方对个人信息来源的合法性和合规性作出承诺，如第三方有违反行为的，我们会明确要求对方承担相应法律责任；
        <br />- 在我们向业务合作伙伴共享您的个人信息前，我们会严格要求合作伙伴的信息保护义务与责任，并要求业务合作伙伴在合作前需与NN签署关于数据安全的保护协议，一旦业务合作伙伴有任何违反协议的行为，将须承担相应法律责任；
        <br />- 我们建立了合理有效、科学健全的安全应急响应体系，明确了网络安全事件的分类分级标准、安全应急响应组织及职责，并根据安全事件的不同类型和级别制定了适当的应急响应预案，明确规范了安全事件的报告流程和应急响应处置流程。同时，我们还具备“NN”安全应急响应中心，由专业的安全技术和运营团队负责维护，便于及时有效的响应、处置各类安全漏洞和突发事件，联合相关部门进行安全事件溯源和打击；
        <br />- 如不幸发生个人信息安全事件的，我们将按照法律法规的要求，及时向您告知安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。
        <br />- 请您知悉并理解，互联网并非绝对安全的环境，我们强烈建议通过安全方式、使用复杂密码，协助我们保证您的账号安全。如发现自己的个人信息泄密，尤其是您自己的账户或密码发生泄露，请立即根据本隐私政策文末中提供的联系方式联络我们，以便我们采取相应措施来保护您的个人信息安全。
        <br />七、您对个人信息享有的控制权
        我们将按照中国相关的法律、法规、标准，以及其他国家、地区的成文法、习惯法，保障您对自己的个人信息行驶如下权利：
        <br />（一）查询、更正和补充您的信息
        您有权查询、更正或补充您的信息。您可以通过以下方式自行进行：
        联系NN站内客服：【我的】-【在线客服】-输入“人工客服”进行操作。
        您需要按照要求提交相应的证明材料，如姓名、身份证号、身份证清晰正面照、身份证清晰反面照、手持身份证照的信息来帮助我们确认您的有效身份并协助您更改您的身份信息。
        <br />（二）删除您的信息
        在以下情形中，您可以向我们提出删除个人信息的请求：
        <br />1. 如果我们处理个人信息的行为违反法律法规；
        <br />2. 如果我们收集、使用您的个人信息，却未征得您的明确同意；
        <br />3. 如果我们处理个人信息的行为严重违反了该政策；
        <br />4. 如果您主动注销了账号；
        当我们协助您删除相关信息后，因为适用的法律和安全技术，我们可能无法立即从备份系统中删除相应的信息，我们将安全地存储您的个人信息并将其与任何进一步处理隔离，直到备份可以清除或实现匿名。
        <br />（三）改变您授权同意的范围
        部分功能可能需要您的一些个人信息才能完成，当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。
        <br />（四）注销您的账户
        您可以通过以下方式申请注销您的账户：
        自助申请注销：【我的】-【设置】-【账号与安全】-【安全中心】-【注销账号】进行申请。
        您需要按照“NN”要求提交相应的证明材料，如姓名、身份证号、身份证清晰正面照、身份证清晰反面照、手持身份证照的信息、手机号归属证明来帮助我们确认您的有效身份，并协助您注销您的身份信息。
        <br />（五）约束信息系统自动决策
        在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将在不侵害雷神商业秘密或其他用户权益、社会公共利益、国家利益的前提下做出合理解释。
        <br />（六）响应您的上述请求
        为保障安全，您需要提供上述要求材料，或以其他方式证明您的身份，再处理您的请求，若您拒绝提供相应证明材料，我们将无法响应您的请求。
        我们将在7个工作日内做出答复。
        在以下情形中，按照法律法规要求，我们将无法响应您的请求：
        <br />1. 与国家安全、国防安全、国家利益有关的；
        <br />2. 与公共安全、公共卫生、重大公共利益有关的；
        <br />3. 与犯罪刑事侦查、起诉、立案、审判和执行判决等有关的；
        <br />4. 有充分证据表明个人信息主体存在主观恶意串通妨碍第三人行使合法权益或滥用权利使其他个人、组织的合法权益受到严重损害的；
        <br />5. 涉及商业秘密的。
        <br />八、未成年保护
        雷神重视对未成年人个人隐私信息的保护。雷神将依赖用户提供的个人信息判断用户是否为未成年人。任何18周岁以下的未成年人注册账号或使用本服务应事先取得家长或其法定监护人（以下简称“监护人”）的书面同意。
        我们将根据国家相关法律法规的规定保护未成年人的相关信息。若您是未成年人的监护人，当您对您所监护的未成年人的个人信息有相关疑问时，请通过“如何联系我们”章节中的联系方式与我们联系。如果我们发现在未事先获得可证实的监护人同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据。
        除根据法律法规的规定及有权机关的指示披露外，雷神不会使用向任何第三方透露未成年人的聊天记录及其他个人隐私信息。除本协议约定的例外情形外，未经监护人事先同意，雷神不会使用或向任何第三方透露未成年人的个人隐私信息。
        <br />九、本隐私政策的更新
        为保证您能够获得更好的服务并应平台业务调整以及未来发展，本政策也会与时俱进随之更新。但在更新的同时，我们会以单独、明显的方式获取您的授权，否则我们将维持本政策所赋予您的权利。
        我们在应用程序、官方网站更新版本后或官方发出公告后以合理、适当、明显的方式提醒您相关内容的更新，以便您能更快了解您权利的更迭。
        对于重大变更，我们还会提供更为显著的通知方式（我们会通过包括但不限于邮件、短信、公告、首页或在浏览页面做特别提示等方式，来向您表达政策的更新内容）。
        本政策所指的重大变更包括但不限于：
        <br />1. 我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
        <br />2. 我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
        <br />3. 个人信息共享、转让或公开披露的主要对象发生变化；
        <br />4. 您参与个人信息处理方面的权利及其行使方式发生重大变化；
        <br />5. 我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
        <br />6. 个人信息安全影响评估报告表明存在高风险时。
        我们还将对本隐私权政策的旧版本予以存档，供您查阅。
        <br />
        <br />十、联系我们
        <br />如果您对本政策存有任何疑问.意见或建议，可以通过如下方式与我们联系。
        <br />电子邮件：service@nn.com
        <br />联系NN站内客服：【我的】-【在线客服】-输入“人工客服”进行咨询
        <br />我们将在7天内予以您答复。
        <br />本协议之效力.解释.变更.执行与争议解决均适用中华人民共和国法律。因本协议产生之争议，均应依照中华人民共和国法律予以处理，并由雷神（武汉）信息技术有限公司住所地人民法院管辖。
        <br />如果您对我们的回复不满意，特别是我们的个人信息处理行为损害了您的合法权益，您还可以通过向雷神（武汉）信息技术有限公司住所地人民法院起诉的外部途径寻求解决方案。
      </div>
    </div>
  </el-dialog>
</template>
<script>
export default {
  name: 'LoginPrivarateProtocol',
  data () {
    return {}
  },
  mounted () {},
  computed: {
    isVisible: {
      get () {
        return this.isShow
      },
      set (val) {
        this.$emit('close-dialog')
      }
    }
  },
  created () {},
  props: {
    isShow: {
      type: Boolean,
      default: false
    }
  },
  methods: {
    closeDialog () {
      this.isVisible = false
    }
  }
}
</script>
<style lang='less' scoped>
.container {
  text-align: center;
  padding: 30px 25px;
  .titleWrap {
    font-size: 16px;
    font-weight: bold;
    color: #6236ff;
    margin-bottom: 30px;
  }
  .contentWrap {
    height: 446px;
    overflow: hidden;
    overflow-y: scroll;
    text-align: left;
    font-size: 12px;
    color: #333;
  }
  .userSetting-header-topHeader-close {
    position: absolute;
    right: 10px;
    top: 10px;
    color: #333;
    width: 20px;
    text-align: center;
    height: 20px;
    line-height: 20px;
    cursor: pointer;
  }
}
</style>


