function MobileRegularExp (code, phone) {
  const testList = {
    cn: { name: '中国', check: /^(\+?0?86\-?)?1[2-9]\d{9}$/ },
    tw: { name: '台湾', check: /^(\+?886\-?|0)?9\d{8}$/ },
    hk: { name: '香港', check: /^(\+?852\-?)?[569]\d{3}\-?\d{4}$/ },
    ms: {
      name: '马来西亚',
      check: /^(\+?6?01){1}(([145]{1}(\-|\s)?\d{7,8})|([236789]{1}(\s|\-)?\d{7}))$/
    },
    ph: { name: '菲律宾', check: /^(\+?0?63\-?)?\d{10}$/ },
    th: { name: '泰国', check: /^(\+?0?66\-?)?\d{10}$/ },
    sg: { name: '新加坡', check: /^(\+?0?65\-?)?\d{10}$/ },
    dz: { name: '阿尔及利亚', check: /^(\+?213|0)(5|6|7)\d{8}$/ },
    sy: { name: '叙利亚', check: /^(!?(\+?963)|0)?9\d{8}$/ },
    sa: { name: '沙特阿拉伯', check: /^(!?(\+?966)|0)?5\d{8}$/ },
    us: { name: '美国', check: /^(\+?1)?[2-9]\d{2}[2-9](?!11)\d{6}$/ },
    cz: {
      name: '捷克共和国',
      check: /^(\+?420)? ?[1-9][0-9]{2} ?[0-9]{3} ?[0-9]{3}$/
    },
    de: {
      name: '德国',
      check: /^(\+?49[ \.\-])?([\(]{1}[0-9]{1,6}[\)])?([0-9 \.\-\/]{3,20})((x|ext|extension)[ ]?[0-9]{1,4})?$/
    },
    dk: { name: '丹麦', check: /^(\+?45)?(\d{8})$/ },
    gr: { name: '希腊', check: /^(\+?30)?(69\d{8})$/ },
    au: { name: '澳大利亚', check: /^(\+?61|0)4\d{8}$/ },
    gb: { name: '英国', check: /^(\+?44|0)7\d{9}$/ },
    ca: { name: '加拿大', check: /^(\+?1)?[2-9]\d{2}[2-9](?!11)\d{6}$/ },
    in: { name: '印度', check: /^(\+?91|0)?[789]\d{9}$/ },
    nz: { name: '新西兰', check: /^(\+?64|0)2\d{7,9}$/ },
    za: { name: '南非', check: /^(\+?27|0)\d{9}$/ },
    zm: { name: '赞比亚', check: /^(\+?26)?09[567]\d{7}$/ },
    es: { name: '西班牙', check: /^(\+?34)?(6\d{1}|7[1234])\d{7}$/ },
    fi: {
      name: '芬兰',
      check: /^(\+?358|0)\s?(4(0|1|2|4|5)?|50)\s?(\d\s?){4,8}\d$/
    },
    fr: { name: '法国', check: /^(\+?33|0)[67]\d{8}$/ },
    il: { name: '以色列', check: /^(\+972|0)([23489]|5[0248]|77)[1-9]\d{6}/ },
    hu: { name: '匈牙利', check: /^(\+?36)(20|30|70)\d{7}$/ },
    it: { name: '意大利', check: /^(\+?39)?\s?3\d{2} ?\d{6,7}$/ },
    jp: { name: '日本', check: /^(\+?81|0)\d{1,4}[ \-]?\d{1,4}[ \-]?\d{4}$/ },
    no: { name: '挪威', check: /^(\+?47)?[49]\d{7}$/ },
    be: { name: '比利时', check: /^(\+?32|0)4?\d{8}$/ },
    pl: { name: '波兰', check: /^(\+?48)? ?[5-8]\d ?\d{3} ?\d{2} ?\d{2}$/ },
    br: {
      name: '巴西',
      check: /^(\+?55|0)\-?[1-9]{2}\-?[2-9]{1}\d{3,4}\-?\d{4}$/
    },
    pt: { name: '葡萄牙', check: /^(\+?351)?9[1236]\d{7}$/ },
    ru: { name: '俄罗斯', check: /^(\+?7|8)?9\d{9}$/ },
    rs: { name: '塞尔维亚', check: /^(\+3816|06)[- \d]{5,9}$/ },
    r: { name: '土耳其', check: /^(\+?90|0)?5\d{9}$/ },
    vn: {
      name: '越南',
      check: /^(\+?84|0)?((1(2([0-9])|6([2-9])|88|99))|(9((?!5)[0-9])))([0-9]{7})/
    }
  }
  const pattern = testList[code].check
  return pattern.test(phone)
}

export default MobileRegularExp
